In [1]:
'''
Author: Jason Domzalski
Class: CIS-2532-NET01 Advanced Python Programming
Date: 5/14/2022
File: CIS-2532-NET01 Homework 12 Question 3 Jason Domzalski
Description: Exercise 17.1 from the text book working with the books.db
'''
import sqlite3

In [2]:
connection = sqlite3.connect('books.db')

In [3]:
import pandas as pd

In [4]:
pd.options.display.max_columns = 10

In [5]:
# Select all authors last names from the authors table in descending order
pd.read_sql('SELECT last FROM authors ORDER BY last DESC', connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

In [6]:
# select all book titles from the titles table in ascending order
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [7]:
# Use an INNER JOIN to select all the books for a specific author. Include the title, copyright year and ISBN. Order the information alphabetically by title
pd.read_sql("""SELECT title, copyright, isbn FROM titles INNER JOIN author_ISBN ON authors.id = author_ISBN.id ORDER BY title ASC""", connection).head()

DatabaseError: Execution failed on sql 'SELECT title, copyright, isbn FROM titles INNER JOIN author_ISBN ON authors.id = author_ISBN.id ORDER BY title ASC': ambiguous column name: isbn

In [8]:
# Insert a new author into the authors table
cursor = connection.cursor()

In [9]:
cursor = cursor.execute("""INSERT INTO authors (first, last) VALUES ('Jason', 'Domzalski')""")

In [10]:
# Insert a new title for an author. Remember that the book must have an entry in the author_ISBN table and an entry in the titles table
cursor = cursor.execute("""INSERT INTO titles (isbn, title, edition, copyright) VALUES ('0123456789', 'SAMPLE TITLE', '1', '2022')""")